Repo/FASI/FASI_c/0/ampholyte.HISTIDINE
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v3.0+                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 FoamFile{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ampholyte.HISTIDINE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 dimensions      [0 -3 0 0 1 0 0];

 internalField  nonuniform List<scalar>
5000
 (
2.922788875804555e-18
 6.6476362116778556e-18
 1.5015544243744586e-17
 3.3682775522999353e-17
 7.503373124371655e-17
 1.6598773772496883e-16
 3.646323170022083e-16
 7.953950809966441e-16
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
 inletValue           uniform 00.0;
    phi             flux;
   }
 outlet
    {
        type            inletOutlet;
 inletValue           uniform 100.0;
    phi             flux;
   }

    axis    {
        type            empty;
    }
}
